---
kind: method
id: M:Autodesk.Revit.DB.TableCellStyle.#ctor
source: html/27f2851c-4b58-8a0a-713e-f113004fdb78.htm
---
# Autodesk.Revit.DB.TableCellStyle.#ctor Method

Constructs a new TableCellStyle with default settings.

## Syntax (C#)
```csharp
public TableCellStyle()
```